setwd("/media/glycosylase/EC6A2F256A2EEBD0/Users/miffka/Documents/!DataMining/Statistics3")
getwd()
library(ggplot2)


## ВВЕДЕНИЕ (урок 1.2)


# Первый модуль посвящен ограничениям линейной регрессии

# Во-первых, регрессионный анализ - очень важный метод для статистики.
# Смешанные регрессионные модели - какие методы нужно применять в регрессионном анализе???
# Да, мы знаем, что существует несколько моделей для построения различных регрессиий,
# Которые основаны на различных знаниях о зависимой и независимой переменной
# Большинство задач, тем не менее, сводятся к регрессионной модели ЗП ~ НП
# От регрессии отталкиваются при объяснении более сложных тем.

# Во-вторых, большинство всех ограничений линейной регрессии не выполняется.

# Модуль посвящен трем вопросам:
# Какие ограничения есть у линейной регрессии
# Как понять, что они не выполняются
# Что делать, если они не выполняются

# Итак, какие ограничения у линейной регрессии существуют
# 1) Линейность связи ЗП и НП
# 2) Независимость наблюдений
# 3) Независимость предикторов (проблема мультиколлинеарности)
# 4) Гомоскедастичность
# 5) Нормальное распределение остатков
# 6) Отсутствие автокорреляции остатков

# Почему эти допущения важны
# Мы проверяем наши гипотезы, отталкиваясь от некоторой формы распределения статистик
# Именно это позволяет получать значения p-value
# Когда мы строим регрессионную модель, минимизируя сумму квадратов ошибок,
#  при выполнении допущений регрессионной модели, коэффициенты являются
#  самым хорошим вариантом ответа на вопрос о взаимосвязи.
# Если допущения нарушаются, выводы могут быть диаметрально противоположны наблюдаемой действительности.


## ЛИНЕЙНОСТЬ ВЗАИМОСВЯЗИ (урок 1.3)

ggplot(mtcars, aes(hp, mpg))+
  geom_point()+
  geom_smooth(method = "lm")
# Видим, что существует монотонная взаимосвязь между mpg и hp
# Допустим, эта взимосвязь описывается линейным уравнением
# mpg = b0 + b1*hp
# Получается, что мы считаем "средний наклон связи по больнице"
# Первое "плохо" при отсуствии линейной взаимосвязи - падают задачи предсказания.
# Взаимосвязь по-разному проявляется на разных градациях независимой переменной.
# Предсказание новых значений будет совершенно некорректно.

# СЛЕДУЮЩЕЕ ВИДЕО - НОМЕР 2 из УРОКА 1.3
